/* eslint-disable max-len */

export const errorsText: Record<string, string> = {
  first_name: 'латиница или кириллица, первая буква должна быть заглавной, без пробелов и без цифр, нет спецсимволов допустим только дефис',
  second_name: 'латиница или кириллица, первая буква должна быть заглавной, без пробелов и без цифр, нет спецсимволов допустим только дефис',
  login: 'от 3 до 20 символов, латиница может содержать цифры, но не состоять из них, без пробелов, без спецсимволов(допустимы дефис и нижнее подчёркивание)',
  email: 'латиница, может включать цифры и спецсимволы вроде дефиса и подчёркивания, обязательно должна быть «собака» (@) и точка после неё, но перед точкой обязательно должны быть буквы.',
  password: 'от 8 до 40 символов, обязательно хотя бы одна заглавная буква и цифра.',
  phone: 'от 10 до 15 символов, состоит из цифр, может начинается с плюса.',
  message: 'не должно быть пустым',
}
